tap "armmbed/formulae"
tap "homebrew/bundle"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"

brew "armmbed/formulae/arm-none-eabi-gcc"
brew "gum"
brew "lazygit"
brew "neovim"
brew "nvm"
brew "osx-cross/avr/avr-gcc@9"
brew "qmk/qmk/qmk"
brew "rcm"
brew "tmux"
brew "tmuxp"
brew "yq"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "adobe-creative-cloud"
cask "brave-browser"
cask "discord"
cask "font-ubuntu-mono-nerd-font"
cask "google-chrome"
cask "iterm2"
cask "monitorcontrol"
cask "nordvpn"
cask "qbittorrent"
cask "qmk-toolbox"
cask "rectangle"
cask "slack"
cask "spotify"
cask "stats"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"
cask "zoom"

vscode "dbaeumer.vscode-eslint"
vscode "dprint.dprint"
vscode "dracula-theme.theme-dracula"
vscode "esbenp.prettier-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "rbuckton.tsserver-live-reload"
vscode "twxs.cmake"
vscode "vscodevim.vim"
